# Система бронирований фотостудий 

## Назначение проекта
Система бронирований фотостудий - это веб-приложение, которое поможет клиентам в поиске и бронировании фотостудий для проведения фотосессий. 

## Целевая аудитория
- Профессиональные и начинающие фотографы.
- Частные клиенты, организующие фотосессии.
- Компании, проводящие рекламные и предметные съёмки.

## Описание предметной области 
Фотостудии предоставляют в аренду оборудованные залы для фото и видеосъёмок. Каждый зал имеет свои данные (информацию): площадь, интерьер, доступное оборудование и стоимость аренды за час.
Для организации съёмки клиент выбирает зал, дату, время начала и продолжительность аренды. Система проверяет доступность выбранного временного интервала и рассчитывает стоимость бронирования. Один зал не может быть забронирован несколькими клиентами на пересекающиеся временные интервалы.

## Основные сущности 
- Клиент
- Фотостудия
- Бронирование
- Расписание

## Основные функции 
- Регистрация и авторизация пользователя
- Поиск фотостудий
- Просмотр информации о фотостудии 
- Создание бронирования

## План развития проекта
1. Анализ
2. Проектирование
3. Разработка (базового функционала)
4. Тестирование системы на наличие ошибок и багов
5. Разработка (дополнительного функционала)
6. Тестирование системы на наличие ошибок и багов
7. Запуск в эксплуатацию
8. Возможная доработка функционала в зависимости от отзывов пользователей
